Revit 2024 API
Connector.Direction Property
 The direction of the connector.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public FlowDirectionType Direction { get; }
Visual Basic
Public ReadOnly Property Direction As FlowDirectionType
	Get
Visual C++
public:
property FlowDirectionType Direction {
	FlowDirectionType get ();
}
Remarks
 Instantaneous direction of this connector, calculated according to system.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.InvalidOperationException |  This connector does not support flow calculation and associated properties.
See Also
Connector Class
Autodesk.Revit.DB Namespace